#include "touch.h" 

#define TOUCH_OFFSET_Y 15

touchPos	touch_pos;

iic_bus_t touch_pins =
{
	.IIC_SDA_PORT = GPIOB,
	.IIC_SCL_PORT = GPIOB,
	.IIC_SDA_PIN = GPIO_PIN_4,
	.IIC_SCL_PIN = GPIO_PIN_6,
};

/*
*********************************************************************************************************
*	函 数 名: touch_GPIO_Init
*	功能说明: touch GPIO口初始化
*	形    参：none
*	返 回 值: none
*********************************************************************************************************
*/
void touch_gpio_init(void)
{	
	GPIO_InitTypeDef GPIO_InitStructure = {0};
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	
	/* 初始化复位引脚 */
	GPIO_InitStructure.Pin = TOUCH_RST_PIN;
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Pull = GPIO_PULLUP;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(TOUCH_RST_PORT, &GPIO_InitStructure);
	
	HAL_GPIO_WritePin(TOUCH_RST_PORT,TOUCH_RST_PIN,GPIO_PIN_SET);
	
	
	/* 初始化I2C引脚 */
	IICInit(&touch_pins);

}

/*
*********************************************************************************************************
*	函 数 名: touch_Init
*	功能说明: touch初始化
*	形    参：none
*	返 回 值: none
*********************************************************************************************************
*/
void touch_init(void)
{
	touch_gpio_init();
	touch_config_autosleeptime(5);
}


/*
*********************************************************************************************************
*	函 数 名: touch_IIC_ReadREG
*	功能说明: 读取触摸屏单个寄存器的数据
*	形    参：reg：寄存器地址
*	返 回 值: 返回寄存器存储的数据
*********************************************************************************************************
*/
uint8_t touch_iic_readreg(uint8_t addr)
{
	return IIC_Read_One_Byte(&touch_pins,Device_Addr,addr);
}

/*
*********************************************************************************************************
*	函 数 名: touch_IIC_WriteREG
*	功能说明: 向触摸屏的寄存器写入数据
*	形    参：addr：寄存器地址
*						dat:	写入的数据
*	返 回 值: 返回寄存器存储的数据
*********************************************************************************************************
*/
void touch_iic_writereg(uint8_t addr, uint8_t dat)
{
	IIC_Write_One_Byte(&touch_pins,Device_Addr,addr,dat);
}

/*
*********************************************************************************************************
*	函 数 名: TOUCH_RESET
*	功能说明: 触摸屏复位
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void touch_reset(void)
{
	TOUCH_RST_0;
	HAL_Delay(10);
	TOUCH_RST_1;
	HAL_Delay(100);
}

/*
*********************************************************************************************************
*	函 数 名: TOUCH_READ_X
*	功能说明: 读取触摸屏在触摸时的坐标值
*	形    参：无
*	返 回 值: 无 （数据存储在touch_Instance结构体中）
*********************************************************************************************************
*/
void touch_get_xy_axis(void)
{
	uint8_t DAT[4];
	IIC_Read_Multi_Byte(&touch_pins,Device_Addr,XposH,4,DAT);
	touch_pos.X_Pos=((DAT[0]&0x0F)<<8)|DAT[1];
	touch_pos.Y_Pos=((DAT[2]&0x0F)<<8)|DAT[3] + TOUCH_OFFSET_Y;
}


/*
*********************************************************************************************************
*	函 数 名: touch_Get_FingerNum
*	功能说明: 读取触摸屏的手指触摸个数,0xFF为睡眠
*	形    参：无
*	返 回 值: 返回芯片ID
*********************************************************************************************************
*/
uint8_t touch_get_fingernum(void)
{
	return touch_iic_readreg(FingerNum);
}


/*
*********************************************************************************************************
*	函 数 名: touch_Get_ChipID
*	功能说明: 读取触摸屏的芯片ID
*	形    参：无
*	返 回 值: 返回芯片ID
*********************************************************************************************************
*/
uint8_t touch_get_chipid(void)
{
	return touch_iic_readreg(ChipID);
}




/*
*********************************************************************************************************
*	函 数 名: touch_Config_AutoSleepTime
*	功能说明: 规定time内无触摸，自动进入低功耗模式
*	形    参：time：时间(s)
*	返 回 值: 无
*********************************************************************************************************
*/
void touch_config_autosleeptime(uint8_t time)
{
	touch_iic_writereg(AutoSleepTime,time);
}

/*
*********************************************************************************************************
*	函 数 名: touch_Sleep
*	功能说明: 进入睡眠，无触摸唤醒功能
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void touch_sleep(void)
{
	touch_iic_writereg(SleepMode,0x03);
}

/*
*********************************************************************************************************
*	函 数 名: touch_Wakeup
*	功能说明: 唤醒
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void touch_wakeup(void)
{
	touch_reset();
}

